app/Http/Controllers/Masyarakat/PenjemputanSampahMasyarakatController.php

select * from `kategori` order by `nama_kategori` asc
---
    public function kategori()
    {
        try {
            $kategori = Kategori::orderBy('nama_kategori')
                ->get();

select count(*) as aggregate from `detail_penjemputan` where exists (select * from `penjemputan` where `detail_penjemputan`.`id_penjemputan` = `penjemputan`.`id_penjemputan` and exists (select * from `pelacakan` where `penjemputan`.`id_penjemputan` = `pelacakan`.`id_penjemputan` and `status` = 'Selesai')) and exists (select * from `penjemputan` where `detail_penjemputan`.`id_penjemputan` = `penjemputan`.`id_penjemputan` and exists (select * from `pelacakan` where `penjemputan`.`id_penjemputan` = `pelacakan`.`id_penjemputan` and `id_pengguna_masyarakat` = 89))
select sum(`total_poin`) as aggregate from `penjemputan` where exists (select * from `pelacakan` where `penjemputan`.`id_penjemputan` = `pelacakan`.`id_penjemputan` and `status` = 'Selesai') and `id_pengguna_masyarakat` = 89
select count(*) as aggregate from `penjemputan` where `id_pengguna_masyarakat` = 89
---
    public function totalRiwayatPenjemputan()
    {
        try {
            $totalSampah = DetailPenjemputan::whereHas('penjemputan.pelacakan', function ($query) {
                $query->where('status', 'Selesai');
            })->whereHas('penjemputan.pelacakan', function ($query) {
                $query->where('id_pengguna_masyarakat', Auth::id());
            })->count();
            $totalPoin = Penjemputan::whereHas('pelacakan', function ($query) {
                $query->where('status', 'Selesai');
            })
                ->where('id_pengguna_masyarakat', Auth::id())
                ->sum('total_poin');
            $penjemputan = Penjemputan::orderByDesc("created_at")
                ->where('id_pengguna_masyarakat', Auth::id())
                ->paginate(6);