app/Http/Controllers/Masyarakat/ProfileMasyarakatController.php

    public function showProfile()
    {
        $user = Pengguna::findOrFail(Auth::user()->id_pengguna);
---
select * from `pengguna` where `pengguna`.`id_pengguna` = 89 limit 1