app/Http/Controllers/MitraKurir/PenjemputanSampahMitraKurirController.php

    public function permintaan()
    {
        try {
            if (!Auth::user()) {
                $userLogin = User::where('id_peran', 3)->first();
            } else {
                $userLogin = Auth::user()->id_pengguna;
            }

            // $penjemputan = Penjemputan::with(['daerah', 'dropbox', 'penggunaMasyarakat', 'penggunaKurir', 'detailPenjemputan'])
            // 'Diproses','Diterima','Dijemput Kurir','Menuju Lokasi Penjemputan','Sampah Diangkut','Menuju Dropbox','Menyimpan Sampah di Dropbox','Selesai','Dibatalkan'
            $penjemputan = Penjemputan::with([
                'penggunaMasyarakat',
                'pelacakan' => function ($query) {
                    $query->orderBy('created_at', 'desc');
                },
                'detailPenjemputan' => function ($query) {
                    $query->select('id_penjemputan', 'id_kategori')
                        ->selectRaw('COUNT(*) as jumlah')
                        ->groupBy('id_penjemputan', 'id_kategori'); // Kelompokkan berdasarkan kategori
                },
            ])
                ->where('id_pengguna_kurir', $userLogin)
                ->filter(request(['search', 'total-berat']))
                ->whereHas('pelacakan', function ($query) {
                    $query->where('status', 'diproses');
                })
                ->whereDoesntHave('pelacakan', function ($query) {
                    $query->where('status', '!=', 'diproses');
                })
                ->paginate(6);
---
select count(*) as aggregate from `penjemputan` where `id_pengguna_kurir` = 82 and exists (select * from `pelacakan` where `penjemputan`.`id_penjemputan` = `pelacakan`.`id_penjemputan` and `status` = 'Diproses')


            // dd($penjemputan);

            $kategori = Kategori::all();
---
select * from `kategori`