app/Http/Controllers/MitraKurir/RegistrasiMitraKurirController.php

    public function OtpValidation(Request $request){

        $otpInp = $request->input('otp1') . $request->input('otp2') . $request->input('otp3') . $request->input('otp4');

        $otp = UserOTP::where('otp_token',$otpInp)->where('otp_kadaluarsa','>',now())->first();
            if (!$otp) {
                return redirect()->back()->withErrors([
                    'otp_code' => 'OTP salah atau kadaluarsa'
                ]);
            }
    $otp->user->tanggal_email_diverifikasi = Date::now();
    $otp->user->save();
    $user = User::where('id_pengguna',$otp->id_pengguna)->first();
---
select * from `pengguna` where `id_pengguna` = 92 limit 1