app/Http/Controllers/APIController.php

select * from `jenis` where `nama_jenis` like '%Lemari es%'
---
    public function getJenis(Request $request, $id = null)
    {
        $search = $request->input('search');

        $query = Jenis::query();

        if ($id) {
            $query->where('id_kategori', $id);
        }

        if ($search) {
            $query->where('nama_jenis', 'like', '%' . $search . '%');
        }

        $jenis = $query->get();

select * from `daerah`
---
    public function getDaerah(Request $request)
    {
        $search = $request->input('search');
        $id = $request->input('id');

        $query = Daerah::query();

        if ($id) {
            $query->where('id_daerah', $id);
        } elseif ($search) {
            $query->where('nama_daerah', 'like', '%' . $search . '%');
        }

        $daerah = $query->get();